FutureDesigns/uEZ/uEZ/Source/Devices/Flash/NXP/LPC1756/LPC1756_IAP.c
/*-------------------------------------------------------------------------*
 * File:  LPC1756_IAP.c
 *-------------------------------------------------------------------------*
 * Description:
 *     
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2015 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZ License.pdf or visit http://goo.gl/UDtTCR for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(r) to your own hardware!   |
 *    |             We can get you up and running fast!               |
*    |      See http://goo.gl/UDtTCR for more details.               |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/

/*-------------------------------------------------------------------------*
 * Includes:
 *-------------------------------------------------------------------------*/
#include <uEZ.h>
#include <string.h>
#include "LPC1756_IAP.h"

/*-------------------------------------------------------------------------*
 * Constants:
 *-------------------------------------------------------------------------*/
#define MAX_NUM_SECTORS             32
#define BLOCK_SIZE                  256

#define IAP_CMD_PREPARE_SECTOR      50
#define IAP_CMD_COPY_TO_FLASH       51
#define IAP_CMD_ERASE_SECTOR        52

typedef TUInt32 TIAPResult;
#define CMD_SUCCESS                 0
#define INVALID_COMMAND             1
#define SRC_ADDR_ERROR              2
#define DST_ADDR_ERROR              3
#define SRC_ADDR_NOT_MAPPED         4
#define DST_ADDR_NOT_MAPPED         5
#define COUNT_ERROR                 6
#define INVALID_SECTOR              7
#define SECTOR_NOT_BLANK            8
#define SECTOR_NOT_PREPARED         9
#define COMPARE_ERROR               10
#define BUSY                        11
#define NOTHING_HAPPENED            0xFF

#define IAP_ROUTINE                 0x1FFF1FF1
#define BLOCK_NONE                  0xFFFFFFFF

#define CONFIG_DISABLE_PLL_ON_IAP_COMMANDS          0
#if CONFIG_DISABLE_PLL_ON_IAP_COMMANDS
#define PRG_FREQUENCY               XTAL_FREQUENCY
#else
#define PRG_FREQUENCY               PROCESSOR_OSCILLATOR_FREQUENCY
#endif

/*-------------------------------------------------------------------------*
 * Types:
 *-------------------------------------------------------------------------*/
typedef struct {
    TInt32 iIndex;
    TUInt32 iAddress;
    TUInt32 iSize;
} T_sector;

typedef struct {
    const DEVICE_Flash *iDevice;
    T_uezSemaphore iSem;
    TUInt32 iNumOpen;
    T_FlashChipInfo iChipInfo;
} T_Flash_NXP_LPC1756_Workspace;

typedef void (*IAPRoutine)(TUInt32 *aParams, TUInt32 *aResults);
#define IAPCall       ((IAPRoutine)IAP_ROUTINE)

/*-------------------------------------------------------------------------*
 * Prototypes:
 *-------------------------------------------------------------------------*/
static T_uezError IIAPCmdErase(TUInt32 aSector);
static T_uezError IIAPPrepareSector(TUInt32 aAddress);

/*-------------------------------------------------------------------------*
 * Globals:
 *-------------------------------------------------------------------------*/
const T_sector G_sectorMemory[MAX_NUM_SECTORS] = {
#if (LPC1756_IAP_PROTECT_FIRST_32K==1)
    {  -1,  0x00000000, 0x00008000 }, // Ignore first 32K
#else
    {   0,  0x00000000, 0x00001000 },
    {   1,  0x00001000, 0x00001000 },
    {   2,  0x00002000, 0x00001000 },
    {   3,  0x00003000, 0x00001000 },
    {   4,  0x00004000, 0x00001000 },
    {   5,  0x00005000, 0x00001000 },
    {   6,  0x00006000, 0x00001000 },
    {   7,  0x00007000, 0x00001000 },
#endif
    {   8,  0x00008000, 0x00001000 },
    {   9,  0x00009000, 0x00001000 },
    {  10,  0x0000A000, 0x00001000 },
    {  11,  0x0000B000, 0x00001000 },
    {  12,  0x0000C000, 0x00001000 },
    {  13,  0x0000D000, 0x00001000 },
    {  14,  0x0000E000, 0x00001000 },
    {  15,  0x0000F000, 0x00001000 },
    {  16,  0x00010000, 0x00008000 },
    {  17,  0x00018000, 0x00008000 },
    {  18,  0x00020000, 0x00008000 },
    {  19,  0x00028000, 0x00008000 },
    {  20,  0x00030000, 0x00008000 },
    {  21,  0x00038000, 0x00008000 },
    {  22,  0x00040000, 0x00008000 },
    {  23,  0x00048000, 0x00008000 },
    {  24,  0x00050000, 0x00008000 },
    {  25,  0x00058000, 0x00008000 },
    {  26,  0x00060000, 0x00008000 },
    {  27,  0x00068000, 0x00008000 },
    {  28,  0x00070000, 0x00008000 },
    {  29,  0x00078000, 0x00008000 },
    {  -1,  0x00080000, 0xFFF80000 }    // Stop here
};

TBool G_sectorsNeedingErase[MAX_NUM_SECTORS];
TUInt8 G_block[BLOCK_SIZE];
TUInt32 G_parameters[5];
TUInt32 G_results[4];
TUInt32 G_lastBlock;

/*-------------------------------------------------------------------------*
 * Function:  CPUEnableInterrupts
 *-------------------------------------------------------------------------*
 * Description:
 *      Enables all standard CPU interrupts (IRQ).
 *-------------------------------------------------------------------------*/
static TIAPResult IIAPCmd(TUInt8 aCmd)
{
    // Pass on the command
    G_parameters[0] = aCmd;

    // Zap results so we know if nothing happened
    G_results[0] = NOTHING_HAPPENED;

    // Execute with interrupts turned off
    portDISABLE_INTERRUPTS();

    // Before doing any IAP commands, turn off the PLL
#if CONFIG_DISABLE_PLL_ON_IAP_COMMANDS
    CPUPLLStop();
#endif

    IAPCall(G_parameters, G_results);

    // Regardless of the result, turn back on the PLL
#if CONFIG_DISABLE_PLL_ON_IAP_COMMANDS
    CPUPLLStart();
#endif

    portENABLE_INTERRUPTS();

    return G_results[0];
}

/*---------------------------------------------------------------------------*
 * Routine:  IIAPAddressToSectorNumber
 *---------------------------------------------------------------------------*
 * Description:
 *      Convert the address into a sector number.
 * Outputs:
 *      TUInt32                   -- Sector number, or -1 if invalid.
 *---------------------------------------------------------------------------*/
static TInt32 IIAPAddressToSectorNumber(TUInt32 aAddress)
{
    const T_sector *p_sector = G_sectorMemory;
    const T_sector *p_prev = 0;

    while (1) {
        if (aAddress < p_sector->iAddress)
            return p_prev->iIndex;
        p_prev = p_sector;
        p_sector++;
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  IIAPEraseIfNotErased
 *---------------------------------------------------------------------------*
 * Description:
 *      Erase the given sector if not already erased.
 * Outputs:
 *      T_uezError -- UEZ_ERROR_NONE if successful, else error code.
 *---------------------------------------------------------------------------*/
static T_uezError IIAPEraseIfNotErased(TUInt32 aSector)
{
    T_uezError error;
    if (G_sectorsNeedingErase[aSector])
        error = IIAPCmdErase(aSector);
    else
        error = UEZ_ERROR_NONE;
    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  IIAPCopyBytes
 *---------------------------------------------------------------------------*
 * Description:
 *      Copy in a section of bytes into the block offset by a prefix.
 * Inputs:
 *      TUInt8 *aData -- Pointer to data to read
 *      TUInt32 aPrefix -- Offset into the block to read
 *      TUInt32 aNumBytes -- Number of bytes to read.
 *---------------------------------------------------------------------------*/
static void IIAPCopyBytes(TUInt8 *aData, TUInt32 aPrefix, TUInt32 aNumBytes)
{
    TUInt32 i;

