FutureDesigns/uEZ/uEZ/Source/Devices/Flash/NXP/LPC1756/LPC1756_IAP.c
    // Copy over the section of bytes we are going to
    // write
    for (i = 0; i < aNumBytes; i++, aData++)
        G_block[aPrefix++] = *aData;
}

/*---------------------------------------------------------------------------*
 * Routine:  IIAPCmdErase
 *---------------------------------------------------------------------------*
 * Description:
 *      Erase the given sector.
 * Inputs:
 *      TUInt32 aSector -- Sector to erase
 * Outputs:
 *      T_uezError -- UEZ_ERROR_NONE if successful, else error code.
 *---------------------------------------------------------------------------*/
static T_uezError IIAPCmdErase(TUInt32 aSector)
{
    T_uezError error;

    // Prepare the sector for erase
    error = IIAPPrepareSector(aSector);
    if (error)
        return error;

    // Start sector
    G_parameters[1] = aSector;
    // End sector
    G_parameters[2] = aSector;
    // Clock frequency in kHz
    G_parameters[3] = PRG_FREQUENCY / 1000;

    if (IIAPCmd(IAP_CMD_ERASE_SECTOR) != CMD_SUCCESS)
        return UEZ_ERROR_COULD_NOT_ERASE;

    // Mark sector as erased
    G_sectorsNeedingErase[aSector] = EFalse;

    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  IIAPPrepareSector
 *---------------------------------------------------------------------------*
 * Description:
 *      Prepare a sector for modification.
 * Inputs:
 *      TUInt32 aSector -- Sector to prepare
 * Outputs:
 *      T_uezError -- UEZ_ERROR_NONE if successful, else error code.
 *---------------------------------------------------------------------------*/
static T_uezError IIAPPrepareSector(TUInt32 aSector)
{
    // Start and end sector are the same
    G_parameters[1] = G_parameters[2] = aSector;

    if (IIAPCmd(IAP_CMD_PREPARE_SECTOR) != CMD_SUCCESS)
        return UEZ_ERROR_INCOMPLETE;

    // Got here?  Then it was good
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  IIAPFlashBlock
 *---------------------------------------------------------------------------*
 * Description:
 *      Flash a block of data with the current block.
 * Inputs:
 *      TUInt32 aAddress -- Address to write block
 *      TUInt32 aNumBytes -- Number of bytes to write
 * Outputs:
 *      T_uezError -- UEZ_ERROR_NONE if successful, else error code.
 *---------------------------------------------------------------------------*/
static T_uezError IIAPFlashBlock(TUInt32 aAddress, TUInt32 aNumBytes)
{
    // First, we have to prep the location
    IIAPPrepareSector(IIAPAddressToSectorNumber(aAddress));

    // Now we can write the complete block
    G_parameters[1] = aAddress;
    G_parameters[2] = (TUInt32)G_block;
    G_parameters[3] = aNumBytes;
    G_parameters[4] = PRG_FREQUENCY / 1000;

    if (IIAPCmd(IAP_CMD_COPY_TO_FLASH) != CMD_SUCCESS)
        return UEZ_ERROR_READ_WRITE_ERROR;

    // Got here, must have been good
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  IIAPSelectBlock
 *---------------------------------------------------------------------------*
 * Description:
 *      Select which block we are going to modify next
 * Inputs:
 *      TUInt32 aBlockAddress -- Address to select
 * Outputs:
 *      T_uezError -- UEZ_ERROR_NONE if successful, else error code.
 *---------------------------------------------------------------------------*/
static T_uezError IIAPSelectBlock(TUInt32 aBlockAddress)
{
    TUInt32 i;
    TInt32 sector;
    T_uezError error = UEZ_ERROR_NONE;

    // Is this the same block as last time?
    if (aBlockAddress != G_lastBlock) {
        // We're about to change blocks
        // Is the last block a real block?
        if (G_lastBlock != BLOCK_NONE) {
            // Which sector is this located?
            sector = IIAPAddressToSectorNumber(G_lastBlock);

            // Is this allowed?  If not, respond with a failure
            if (sector == -1)
                return UEZ_ERROR_NOT_FOUND;

            // Erase this block if needed.  If error, fail.
            error = IIAPEraseIfNotErased(sector);
            if (error)
                return error;

            // Time to write this block to flash.
            // Do the actual write and report if failed.
            error = IIAPFlashBlock(G_lastBlock, BLOCK_SIZE);
            if (error)
                return error;
        }

        // Remember what the new block is
        G_lastBlock = aBlockAddress;

        // Fill this block with FFs to match blank flash
        for (i = 0; i < BLOCK_SIZE; i++)
            G_block[i] = 0xFF;

        // We're good and ready
        return error;
    }

    // Otherwise, we're in the same block, keep going
    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  IIAPWrite
 *---------------------------------------------------------------------------*
 * Description:
 *      Write a block of data given an address, some data, and
 *      a number of bytes.  Update the address, data pointer, and number
 *      of bytes for the next block.  Only one block is written before
 *      this routine returns.
 * Inputs:
 *      TUInt32 *aAddress -- Pointer to address to write
 *      TUInt8 **aData -- Pointer to a pointer to the data
 *      TUInt32 *aNumBytes -- Pointer to the number of total bytes to write
 * Outputs:
 *      T_uezError -- UEZ_ERROR_NONE if successful, else error code.
 *---------------------------------------------------------------------------*/
static T_uezError IIAPWrite(
    TUInt32 *aAddress,
    TUInt8 **aData,
    TUInt32 *aNumBytes)
{
    TUInt32 prefix;
    TUInt32 numBytes;
    TUInt32 blockAddr;
    T_uezError error = UEZ_ERROR_NONE;

    // How many bytes of 'prefix' (bytes at the front) do we need skip
    prefix = *aAddress % BLOCK_SIZE;

    // How many bytes would be left after the prefix
    numBytes = BLOCK_SIZE - prefix;

