FutureDesigns/uEZ/uEZ/Source/Devices/Flash/NXP/LPC1756/LPC1756_IAP.c
    // Trim the number of bytes to what we are asking to write
    if (numBytes > *aNumBytes)
        numBytes = *aNumBytes;

    // Where does this block start (should be <= *aAddress)
    blockAddr = *aAddress - prefix;

    // Switch to the right block in memory, writing the last
    // block if needed
    error = IIAPSelectBlock(blockAddr);
    if (error)
        return error;

    // Copy over the data we are going to write
    IIAPCopyBytes(*aData, prefix, numBytes);

    // Update for next position
    *aAddress += numBytes;
    *aNumBytes -= numBytes;
    *aData += numBytes;

    // Everything went through, should be good now.
    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  IAPWrite
 *---------------------------------------------------------------------------*
 * Description:
 *      Write a section of bytes in the flash at the given address, with
 *      the given data, and a number of bytes.  Blocks are erased as
 *      needed (if that option was enabled).
 * Inputs:
 *      TUInt32 aAddress -- Address to write at
 *      TUInt8 *aData -- Pointer to data to write
 *      TUInt32 aNumBytes -- Number of bytes to write
 * Outputs:
 *      T_uezError -- UEZ_ERROR_NONE if successful, else error code.
 *---------------------------------------------------------------------------*/
T_uezError ILPC1756_IAP_Write(
    TUInt32 aAddress,
    TUInt8 *aData,
    TUInt32 aNumBytes)
{
    T_uezError error = UEZ_ERROR_NONE;

    // Write the given block of data to the given address
    // Cut up the write command into blocks of BLOCK_SIZE size.
    // Keep doing this until all the bytes are processed
    while (aNumBytes) {
        error = IIAPWrite(&aAddress, &aData, &aNumBytes);
        if (error != UEZ_ERROR_NONE)
            return error;
    }
    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  IAPSessionStart
 *---------------------------------------------------------------------------*
 * Description:
 *      Start a new IAP session.  If ETrue is passed in, blocks need to
 *      be erased, otherwise try to overwrite existing blocks.
 *---------------------------------------------------------------------------*/
T_uezError ILPC1756_IAP_Start(TBool aNeedErasing)
{
    TUInt32 i;

    // Declare all sectors need to be erased
    for (i = 0; i < MAX_NUM_SECTORS; i++)
        G_sectorsNeedingErase[i] = aNeedErasing;

    // Declare no blocks loaded in memory
    G_lastBlock = BLOCK_NONE;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  IAPSessionEnd
 *---------------------------------------------------------------------------*
 * Description:
 *      End an IAP session writing any buffered data.
 * Outputs:
 *      T_uezError -- UEZ_ERROR_NONE if successful, else error code.
 *---------------------------------------------------------------------------*/
T_uezError ILPC1756_IAP_End(void)
{
    // Write the last block out (if any)
    return IIAPSelectBlock(BLOCK_NONE);
}

/******************************************************************************
 Macro definitions
 ******************************************************************************/

/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*
 * Prototypes:
 *---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*
 * Routine:  Flash_NXP_LPC1756_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup of this workspace for Data Flash. For the NXP LPC1756, we allow the MCU to
 *      access the data flash area.
 * Inputs:
 *      void *aW                    -- Workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError Flash_NXP_LPC1756_InitializeWorkspace(void *aW)
{
    T_uezError error;

    T_Flash_NXP_LPC1756_Workspace *p = (T_Flash_NXP_LPC1756_Workspace *)aW;

    // Then create a semaphore to limit the number of accessors
    error = UEZSemaphoreCreateBinary(&p->iSem);

    p->iNumOpen = 0;
    
    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  Flash_NXP_LPC1756_Open
 *---------------------------------------------------------------------------*
 * Description:
 *      Open the flash device. Initialize the flash
 * Inputs:
 *      void *aW                    -- Workspace
 *      TUInt32 aAddress            -- Base address into device to read
 *      TUInt8 *aBuffer             -- Pointer to buffer to receive data
 *      TUInt32 aNumBytes           -- Number of bytes to read
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError Flash_NXP_LPC1756_Open(void *aWorkspace)
{
    T_Flash_NXP_LPC1756_Workspace *p =
        (T_Flash_NXP_LPC1756_Workspace *)aWorkspace;
    /* Declare erase operation result container variable */
    p->iNumOpen++;
    if (p->iNumOpen == 1) {
        // If the first time, assume we were in some programming mode
        // and need to reset and Re-enable access to the Flash Data area
//        ILPC1756_IAP_Start(EFalse); // we don't erase by default
          ILPC1756_IAP_Start(ETrue); // we don't erase by default
    }

    return ((T_uezError)UEZ_ERROR_NONE);
}

/*---------------------------------------------------------------------------*
 * Routine:  Flash_NXP_LPC1756_Close
 *---------------------------------------------------------------------------*
 * Description:
 *      Close the flash device.  For the NXP LPC1756, the flash area access
 *      needs to be closed using IExitProgramMode.
 * Inputs:
 *      void *aW                    -- Workspace
 *      TUInt32 aAddress            -- Base address into device to read
 *      TUInt8 *aBuffer             -- Pointer to buffer to receive data
 *      TUInt32 aNumBytes           -- Number of bytes to read
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError Flash_NXP_LPC1756_Close(void *aWorkspace)
{
    T_Flash_NXP_LPC1756_Workspace *p =
        (T_Flash_NXP_LPC1756_Workspace *)aWorkspace;
    if (p->iNumOpen) {
        p->iNumOpen--;
        if (p->iNumOpen == 0) {
            ILPC1756_IAP_End();
        }
        return UEZ_ERROR_NONE;
    } else {
        return UEZ_ERROR_NOT_OPEN;
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  Flash_NXP_LPC1756_Read
 *---------------------------------------------------------------------------*
 * Description:
 *      Read bytes out of the Flash.
 * Inputs:
 *      void *aW                    -- Workspace
 *      TUInt32 aOffset             -- Byte Offset address into flash to read
 *      TUInt8 *aBuffer             -- Pointer to buffer to receive data
 *      TUInt32 aNumBytes           -- Number of bytes to read
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError Flash_NXP_LPC1756_Read(
    void *aWorkspace,
    TUInt32 aOffset,
    TUInt8 *aBuffer,
    TUInt32 aNumBytes)
{
    T_Flash_NXP_LPC1756_Workspace *p =
        (T_Flash_NXP_LPC1756_Workspace *)aWorkspace;
    T_uezError error = UEZ_ERROR_NONE;

