FutureDesigns/uEZ/uEZ/Source/Devices/Flash/NXP/LPC1756/LPC1756_IAP.c
    // Make sure its not in a programming mode.
    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);

    ILPC1756_IAP_End();

    // The memory is now accessible, copy the data over
    // Simple copy with check to see if the requested area is within the data flash
    if ((aOffset + (TUInt32)aNumBytes) <= (512 * 1024)) {
        memcpy(aBuffer, (void *)(aOffset), aNumBytes);
    } else {
        return UEZ_ERROR_OUT_OF_RANGE;
    }

    UEZSemaphoreRelease(p->iSem);

    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  Flash_NXP_LPC1756_Write
 *---------------------------------------------------------------------------*
 * Description:
 *      Write bytes into the Flash
 * Inputs:
 *      void *aW                    -- Workspace
 *      TUInt32 aOffset             -- Byte Offset into flash to write
 *      TUInt8 *aBuffer             -- Pointer to buffer of data
 *      TUInt32 aNumBytes           -- Number of bytes to write
 * Outputs:
 *      T_uezError                  -- Error code.  Returns
 *                                      UEZ_ERROR_BAD_ALIGNMENT if offset
 *                                      or number of bytes
 *                                      is not on word boundary.
 *---------------------------------------------------------------------------*/
T_uezError Flash_NXP_LPC1756_Write(
    void *aWorkspace,
    TUInt32 aOffset,
    TUInt8 *aBuffer,
    TUInt32 aNumBytes)
{
    T_Flash_NXP_LPC1756_Workspace *p =
        (T_Flash_NXP_LPC1756_Workspace *)aWorkspace;
    T_uezError error = UEZ_ERROR_NONE;

    // Let's do it
    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);

    // Write the given block of data to the given address
    // Cut up the write command into blocks of BLOCK_SIZE size.
    // Keep doing this until all the bytes are processed
    while (aNumBytes) {
        error = IIAPWrite(&aOffset, &aBuffer, &aNumBytes);
        if (error != UEZ_ERROR_NONE)
            break;
    }

    UEZSemaphoreRelease(p->iSem);

    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  Flash_NXP_LPC1756_BlockErase
 *---------------------------------------------------------------------------*
 * Description:
 *      Erase one or more blocks in the given location
 * Inputs:
 *      void *aW                    -- Workspace
 *      TUInt32 aOffset             -- Byte offset into the flash memory
 *      TUInt32 aNumBytes           -- Number of bytes
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError Flash_NXP_LPC1756_BlockErase(
    void *aWorkspace,
    TUInt32 aOffset,
    TUInt32 aNumBytes)
{
    T_Flash_NXP_LPC1756_Workspace *p =
        (T_Flash_NXP_LPC1756_Workspace *)aWorkspace;
    TInt32 blockNum;
    TInt32 blockEnd;

    T_uezError error = UEZ_ERROR_NONE;

    // No bytes?  Do nothing
    if (aNumBytes == 0)
        return UEZ_ERROR_NONE;

    // Find the block
    blockNum = IIAPAddressToSectorNumber(aOffset);
    if (blockNum == -1)
        return UEZ_ERROR_NOT_FOUND;
    blockEnd = IIAPAddressToSectorNumber(aOffset+aNumBytes-1);
    if (blockEnd == -1)
        return UEZ_ERROR_NOT_FOUND;

    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);

    // Erase that block
    while (blockNum <= blockEnd) {
        error = IIAPCmdErase(blockNum++);
        if (error)
            break;
    }

    // Done erasing, resume normal control
    UEZSemaphoreRelease(p->iSem);

    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  Flash_NXP_LPC1756_ChipErase
 *---------------------------------------------------------------------------*
 * Description:
 *      Erase the complete chip
 * Inputs:
 *      void *aW                    -- Workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError Flash_NXP_LPC1756_ChipErase(void *aWorkspace)
{
    T_Flash_NXP_LPC1756_Workspace *p =
        (T_Flash_NXP_LPC1756_Workspace *)aWorkspace;
    T_uezError error;
    TUInt32 sector;

    // Prepare the sector for erase
    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);
#if LPC1756_IAP_PROTECT_FIRST_64K
    sector=16; // Skip the first 64K
#else
    sector=0;
#endif      
    for (; sector<30; sector++) {
        error = IIAPPrepareSector(sector);
        if (error)
            break;

        // Start sector
        G_parameters[1] = sector;
        // End sector
        G_parameters[2] = sector;
        // Clock frequency in kHz
        G_parameters[3] = PRG_FREQUENCY / 1000;

        if (IIAPCmd(IAP_CMD_ERASE_SECTOR) != CMD_SUCCESS) {
            error = UEZ_ERROR_COULD_NOT_ERASE;
            break;
        }

        // Mark sector as erased
        G_sectorsNeedingErase[sector] = EFalse;
        break;
    }
    UEZSemaphoreRelease(p->iSem);

    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  Flash_NXP_LPC1756_QueryReg
 *---------------------------------------------------------------------------*
 * Description:
 *      Query the chip for the given register (word based address).
 * Inputs:
 *      void *aWorkspace            -- Workspace
 *      TUInt32 aReg                -- Register to query
 *      TUInt32 *aValue             -- Place to store value returned
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError Flash_NXP_LPC1756_QueryReg(
    void *aWorkspace,
    TUInt32 aReg,
    TUInt32 *aValue)
{
    T_uezError error = UEZ_ERROR_NONE;
    PARAM_NOT_USED(aWorkspace);
    PARAM_NOT_USED(aReg);

    // Do nothing
    *aValue = 0;

    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  Flash_NXP_LPC1756_GetChipInfo
 *---------------------------------------------------------------------------*
 * Description:
 *      Get information about the chip size
 * Inputs:
 *      void *aW                    -- Workspace
 *      T_FlashChipInfo *aInfo      -- Pointer to structure to receive info
 * Outputs:
 *      T_uezError                   -- Error code.  Returns UEZ_ERROR_NOT_FOUND
 *                                      if flash information is not found
 *                                      (in this case, missing QRY header)
 *---------------------------------------------------------------------------*/
T_uezError Flash_NXP_LPC1756_GetChipInfo(
    void *aWorkspace,
    T_FlashChipInfo *aInfo)
{
    PARAM_NOT_USED(aWorkspace);

