FutureDesigns/uEZ/uEZ/Source/Devices/Flash/NXP/LPC1756/LPC1756_IAP.c
    // Manually fill in the structure with a list
    // of 16x 4K blocks followed by 14x 16K blocks
    aInfo->iBitWidth = 8;
    aInfo->iNumBytesHigh = 0;
    aInfo->iNumBytesLow = 512*1024;
    aInfo->iNumRegions = 2;
    aInfo->iRegions[0].iNumEraseBlocks = 16;
    aInfo->iRegions[0].iSizeEraseBlock = 4*1024;
    aInfo->iRegions[1].iNumEraseBlocks = 14;
    aInfo->iRegions[1].iSizeEraseBlock = 32*1024;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  Flash_NXP_LPC1756_GetBlockInfo
 *---------------------------------------------------------------------------*
 * Description:
 *      Get information about the block
 * Inputs:
 *      void *aW                    -- Workspace
 *      TUInt32 aOffset             -- Byte offset into flash
 *      T_FlashChipInfo *aInfo      -- Pointer to structure to receive info
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError Flash_NXP_LPC1756_GetBlockInfo(
    void *aWorkspace,
    TUInt32 aOffset,
    T_FlashBlockInfo *aBlockInfo)
{
    if (aOffset < 0x10000) {
        // 4K blocks
        aBlockInfo->iOffset = aOffset & 0xFFFFF000;
        aBlockInfo->iSize = 0x1000;
    } else {
        // 32K blocks
        aBlockInfo->iOffset = aOffset & 0xFFFF8000;
        aBlockInfo->iSize = 0x8000;
    }

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Device Interface table:
 *---------------------------------------------------------------------------*/
const DEVICE_Flash Flash_NXP_LPC1756_Interface = { {
// Common device interface
    "Flash:NXP:LPC1756:16Bit",
    0x0100, //<<---- What is the 0x100 stand for??
    Flash_NXP_LPC1756_InitializeWorkspace,
    sizeof(T_Flash_NXP_LPC1756_Workspace), },

// Functions
    Flash_NXP_LPC1756_Open,
    Flash_NXP_LPC1756_Close,
    Flash_NXP_LPC1756_Read,
    Flash_NXP_LPC1756_Write,
    Flash_NXP_LPC1756_BlockErase,
    Flash_NXP_LPC1756_ChipErase,
    Flash_NXP_LPC1756_QueryReg,
    Flash_NXP_LPC1756_GetChipInfo,
    Flash_NXP_LPC1756_GetBlockInfo, };

/*-------------------------------------------------------------------------*
 * End of File:  LPC1756_IAP.c
 *-------------------------------------------------------------------------*/
